# 2. How to read  tabular data file into Pandas ?

In [2]:
import pandas as pd #importing pandas 
orders = pd.read_table ('http://bit.ly/chiporders') #importing data and saving it as data frame object.

In [ ]:
orders.head(2) #displaying data frame created above , by deafult head() shows top 5 rows & tail() below 5 rows.

In [ ]:
# Notes:By default read_table assumes 
# 1 - file is tab seperated.
# 2 - 1st row is header row.

### 2.1 Handling "non tab seperated " and "Header less" data.

In [3]:
pd.read_table ('http://bit.ly/movieusers').head(3)

   1|24|M|technician|85711
0       2|53|F|other|94043
1      3|23|M|writer|32067
2  4|24|M|technician|43537